pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_syntax.h
//---------------------------------------------------------------------------------------------------------------------*
//                                                                                                                     *
//                                               File 'pic18_syntax.h'                                                 *
//                                             Generated by version 2.7.0                                              *
//                                           august 8th, 2014, at 20h3'55"                                             *
//                                                                                                                     *
//---------------------------------------------------------------------------------------------------------------------*

//--- START OF USER ZONE 1


//--- END OF USER ZONE 1

#ifndef pic18_syntax_ENTITIES_DEFINED
#define pic18_syntax_ENTITIES_DEFINED

//---------------------------------------------------------------------------------------------------------------------*

#include "galgas2/predefined-types.h"

//---------------------------------------------------------------------------------------------------------------------*

#include "piccolo_lexique.h"

//---------------------------------------------------------------------------------------------------------------------*

#include "pic18_metamodel.h"
#include "generic_metamodel.h"
#include "pic18_semantics.h"
#include "piccolo_config.h"
#include "piccoloDevice_semantics.h"
#include "ram_sections.h"
#include "ipic18_build_block_representation.h"
#include "ipic18_optimize_block.h"
#include "ipic18_display_block_list.h"
#include "ipic18_block_representation.h"
#include "ipic18_regular_instructions.h"
#include "pic18_mnemonics.h"
#include "ipic18_terminators.h"
#include "intermediate_generic.h"
#include "ipic18_block_ordering.h"
#include "ipic18_cluster_ordering.h"
#include "ipic18_relatives_resolution.h"
#include "ipic18_code_generation.h"
#include "ipic18_stack_computations.h"
#include "pic18_used_routines.h"
#include "piccolo_embedded_devices.h"
#include "pic18_routine_inlining.h"

//---------------------------------------------------------------------------------------------------------------------*

//---------------------------------------------------------------------------------------------------------------------*
//                                                                                                                     *
//                                       Parser class 'pic18_syntax' declaration                                       *
//                                                                                                                     *
//---------------------------------------------------------------------------------------------------------------------*

class cParser_pic_31__38__5F_syntax {
//--- Virtual destructor
  public : virtual ~ cParser_pic_31__38__5F_syntax (void) {}

//--- Non terminal declarations
  protected : virtual void nt_bit_5F_number_5F_parsing_ (class GALGAS_bitNumberExpression & outArgument0,
                                                         class C_Lexique_piccolo_5F_lexique * inLexique) = 0 ;

  protected : virtual void nt_bit_5F_number_5F_parsing_parse (class C_Lexique_piccolo_5F_lexique * inLexique) = 0 ;

  protected : virtual void nt_bit_5F_number_5F_parsing_indexing (class C_Lexique_piccolo_5F_lexique * inLexique) = 0 ;

  protected : virtual void nt_block_5F_termination_ (class GALGAS_abstractBlockTerminationForBlockInstruction & outArgument0,
                                                     class C_Lexique_piccolo_5F_lexique * inLexique) = 0 ;

  protected : virtual void nt_block_5F_termination_parse (class C_Lexique_piccolo_5F_lexique * inLexique) = 0 ;

  protected : virtual void nt_block_5F_termination_indexing (class C_Lexique_piccolo_5F_lexique * inLexique) = 0 ;

  protected : virtual void nt_body_ (class GALGAS_pic_31__38_InterruptDefinitionList & ioArgument0,
                                     class GALGAS_pic_31__38_RoutineDefinitionList & ioArgument1,
                                     class GALGAS_lstringlist & ioArgument2,
                                     class GALGAS_lstringlist & ioArgument3,
                                     class GALGAS_ramDefinitionList & ioArgument4,
                                     class GALGAS_lstringlist & ioArgument5,
                                     class GALGAS_configDefinitionList & ioArgument6,
                                     class GALGAS_constantDefinitionList & ioArgument7,
                                     class GALGAS_checkpicList & ioArgument8,
                                     class GALGAS_dataList & ioArgument9,
                                     class GALGAS_bool & ioArgument10,
                                     class GALGAS_bool & ioArgument11,
                                     class C_Lexique_piccolo_5F_lexique * inLexique) = 0 ;

  protected : virtual void nt_body_parse (class C_Lexique_piccolo_5F_lexique * inLexique) = 0 ;

  protected : virtual void nt_body_indexing (class C_Lexique_piccolo_5F_lexique * inLexique) = 0 ;

  protected : virtual void nt_checkpic_5F_definition_ (class GALGAS_checkpicList & ioArgument0,
                                                       class C_Lexique_piccolo_5F_lexique * inLexique) = 0 ;

  protected : virtual void nt_checkpic_5F_definition_parse (class C_Lexique_piccolo_5F_lexique * inLexique) = 0 ;

  protected : virtual void nt_checkpic_5F_definition_indexing (class C_Lexique_piccolo_5F_lexique * inLexique) = 0 ;

  protected : virtual void nt_condition_5F_expression_ (class GALGAS_pic_31__38_ConditionExpression & outArgument0,
                                                        class C_Lexique_piccolo_5F_lexique * inLexique) = 0 ;

  protected : virtual void nt_condition_5F_expression_parse (class C_Lexique_piccolo_5F_lexique * inLexique) = 0 ;

